rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/I2C1DevMgr.c
/* Global-scope objects ----------))------------------------------------------*/
QActive * const AO_I2C1DevMgr = (QActive *)&l_I2C1DevMgr;/**< "opaque" AO pointer */

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
 * @brief C "constructor" for I2C1DevMgr "class".
 * Initializes all the timers and queues used by the AO, sets up a deferral
 * queue, and sets of the first state.
 * @param [in]: none.
 * @retval: none
 */
/*${AOs::I2C1DevMgr_ctor} ..................................................*/
void I2C1DevMgr_ctor(void) {
    I2C1DevMgr *me = &l_I2C1DevMgr;

    QActive_ctor( &me->super, (QStateHandler)&I2C1DevMgr_initial );
    QTimeEvt_ctor( &me->i2cTimerEvt, I2C1_DEV_TIMEOUT_SIG );
    QTimeEvt_ctor( &me->i2cOpTimerEvt, I2C1_DEV_OP_TIMEOUT_SIG );
    QTimeEvt_ctor( &me->i2cWriteTimerEvt, EEPROM_POST_WRITE_TIMER_SIG );

    /* Initialize the deferred event queue and storage for it */
    QEQueue_init(
        &me->deferredEvtQueue,
        (QEvt const **)( me->deferredEvtQSto ),
        Q_DIM(me->deferredEvtQSto)
    );

    dbg_slow_printf("Constructor\n");
}

/**
 * @brief I2C1DevMgr Active Object (AO) "class" that manages the all the I2C
 * devices on the I2C1 Bus.
 * This AO manages the devices connected to the I2C1 bus and all events a
 * ssociated with those devices. It deesn't access to the I2C1 bus directly and
 * instead communicates with the I2CBusMgr AO to request and monitor the direct
 * I2C commands that need to be sent down that are specific for the device that
 * is currently being handled.  See I2CDevMgr.qm for diagram and model.
 */
/*${AOs::I2C1DevMgr} .......................................................*/
/*${AOs::I2C1DevMgr::SM} ...................................................*/
static QState I2C1DevMgr_initial(I2C1DevMgr * const me, QEvt const * const e) {
    /* ${AOs::I2C1DevMgr::SM::initial} */
    (void)e;        /* suppress the compiler warning about unused parameter */

    me->iBus = I2CBus1;          /* This AO only handles devices on I2CBus1 */

    QS_OBJ_DICTIONARY(&l_I2C1DevMgr);
    QS_FUN_DICTIONARY(&QHsm_top);
    QS_FUN_DICTIONARY(&I2C1DevMgr_initial);
    QS_FUN_DICTIONARY(&I2C1DevMgr_Active);
    QS_FUN_DICTIONARY(&I2C1DevMgr_Idle);

    QActive_subscribe((QActive *)me, EEPROM_SN_READ_SIG);
    QActive_subscribe((QActive *)me, EEPROM_EUI64_READ_SIG);
    QActive_subscribe((QActive *)me, EEPROM_RAW_MEM_WRITE_SIG);
    QActive_subscribe((QActive *)me, EEPROM_RAW_MEM_READ_SIG);
    QActive_subscribe((QActive *)me, IOEXP_REG_READ_SIG);
    QActive_subscribe((QActive *)me, IOEXP_REG_WRITE_SIG);
    return Q_TRAN(&I2C1DevMgr_Idle);
}

/**
 * @brief This state is a catch-all Active state.
 * If any signals need to be handled that do not cause state transitions and
 * are common to the entire AO, they should be handled here.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2C1DevMgr::SM::Active} ...........................................*/
static QState I2C1DevMgr_Active(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active} */
        case Q_ENTRY_SIG: {
            /* Post and disarm all the timer events so they can be rearmed at any time */
            QTimeEvt_postIn(
                &me->i2cTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );
            QTimeEvt_disarm(&me->i2cTimerEvt);

            QTimeEvt_postIn(
                &me->i2cOpTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );
            QTimeEvt_disarm(&me->i2cOpTimerEvt);

            QTimeEvt_postIn(
                &me->i2cWriteTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );
            QTimeEvt_disarm(&me->i2cWriteTimerEvt);

            /* Enable and test the IO expander */
//            DBG_printf("Initializing IOExpander\n");
//            uint8_t status = IOE16_Config();
//            DBG_printf("Init returned status %d\n", status);
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&QHsm_top);
            break;
        }
    }
    return status_;
}

/**
 * @brief   This state indicates that the I2C is currently busy and cannot
 * process incoming data; incoming events will be deferred in this state and
 * handled once the AO goes back to Idle state.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2C1DevMgr::SM::Active::Busy} .....................................*/
static QState I2C1DevMgr_Busy(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy} */
        case Q_ENTRY_SIG: {
            /* Post a timer on entry */
            QTimeEvt_rearm(
                &me->i2cTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_DEV_REQ )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm( &me->i2cTimerEvt ); /* Disarm timer on exit */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::I2C1_DEV_TIMEOUT} */
        case I2C1_DEV_TIMEOUT_SIG: {
            ERR_printf("I2C1Dev timeout occurred with error: 0x%08x\n", me->errorCode);
            status_ = Q_TRAN(&I2C1DevMgr_Idle);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::EEPROM_RAW_MEM_READ, EEPROM_SN_READ, EEPROM_EUI64_READ, EEPROM_RAW_MEM_WRITE, IOEXP_REG_READ, IOEXP_REG_WRITE} */
        case EEPROM_RAW_MEM_READ_SIG: /* intentionally fall through */
        case EEPROM_SN_READ_SIG: /* intentionally fall through */
        case EEPROM_EUI64_READ_SIG: /* intentionally fall through */
        case EEPROM_RAW_MEM_WRITE_SIG: /* intentionally fall through */
        case IOEXP_REG_READ_SIG: /* intentionally fall through */
        case IOEXP_REG_WRITE_SIG: {
            if (QEQueue_getNFree(&me->deferredEvtQueue) > 0) {
               /* defer the request - this event will be handled
                * when the state machine goes back to Idle state */
               QActive_defer((QActive *)me, &me->deferredEvtQueue, e);
               DBG_printf("Deferring I2C request until current is done\n");
            } else {
               /* notify the request sender that the request was ignored.. */
               ERR_printf("Unable to defer I2C request\n");
            }
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::I2C1_DEV_OP_TIMEOUT} */
        case I2C1_DEV_OP_TIMEOUT_SIG: {
            ERR_printf("I2C1Dev Op timeout occurred with error: 0x%08x\n", me->errorCode);
            status_ = Q_TRAN(&I2C1DevMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Active);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart} ......................*/
static QState I2C1DevMgr_GenerateStart(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_START_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_START_BIT\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_Send7BitAddrTxMode);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode} .................*/
static QState I2C1DevMgr_Send7BitAddrTxMode(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV6_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV6 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_7BIT_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize     = I2C_getI2C1DevAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Transmitter;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_SendInternalAddr);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxMode::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr} ...................*/
static QState I2C1DevMgr_SendInternalAddr(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV8_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV8 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_DEV_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = me->addrStart;
            i2cAddrEvt->addrSize     = I2C_getI2C1MemAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Transmitter;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr::I2C_BUS_DONE::[NoErr?]::[Read?]} */
                if (I2C_OP_MEM_READ == me->i2cDevOp || I2C_OP_REG_READ == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_GenerateStart1);
                }
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr::I2C_BUS_DONE::[NoErr?]::[Write?]} */
                else if (I2C_OP_MEM_WRITE == me->i2cDevOp || I2C_OP_REG_WRITE == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_WriteMem);
                }
                else {
                    status_ = Q_UNHANDLED();
                }
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddr::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1} .....................*/
static QState I2C1DevMgr_GenerateStart1(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_START_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_Send7BitAddrRxMode);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStart1::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode} .................*/
static QState I2C1DevMgr_Send7BitAddrRxMode(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV6_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV6 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_7BIT_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize     = I2C_getI2C1DevAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Receiver;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_ReadMem);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxMode::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem} ............................*/
static QState I2C1DevMgr_ReadMem(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_READ_MEM_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_READ )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CReadMemReqEvt *i2cReadMemEvt = Q_NEW( I2CReadMemReqEvt, I2C_BUS_READ_MEM_SIG );
            i2cReadMemEvt->i2cBus           = me->iBus;
            i2cReadMemEvt->addr             = me->addrStart;
            i2cReadMemEvt->addrSize         = I2C_getI2C1MemAddrSize(me->iDev);
            i2cReadMemEvt->memAccessType    = I2C_MEM_DMA;
            i2cReadMemEvt->bytes            = me->bytesTotal; //TODO: remember to fix this.  This should not exceed max page size.
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cReadMemEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CBusDataEvt const *)e)->errorCode) {
                LOG_printf("Got I2C_BUS_DONE with no error\n");
                char tmp[120];
                memset(tmp, 0, sizeof(tmp));
                uint16_t tmpLen = 0;
                CBErrorCode err = CON_hexToStr(
                    (const uint8_t *)((I2CBusDataEvt const *)e)->dataBuf, // data to convert
                    ((I2CBusDataEvt const *)e)->dataLen, // length of data to convert
                    tmp,                                 // where to write output
                    sizeof(tmp),                         // max size of output buffer
                    &tmpLen,                             // size of the resulting output
                    0,                                   // no columns
                    ' '                                  // separator
                );
                if ( ERR_NONE != err ) {
                    WRN_printf("Got an error converting hex array to string.  Error: 0x%08x\n", err);
                }
                LOG_printf("Read %s\n", tmp);
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadMem::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem} ...........................*/
static QState I2C1DevMgr_WriteMem(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_WRITE_MEM_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_WRITE )
            );

