rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/I2C1DevMgr.c
            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CWriteMemReqEvt *i2cWriteMemReqEvt = Q_NEW( I2CWriteMemReqEvt, I2C_BUS_WRITE_MEM_SIG );
            i2cWriteMemReqEvt->i2cBus           = me->iBus;
            i2cWriteMemReqEvt->addr             = me->addrStart;
            i2cWriteMemReqEvt->addrSize         = I2C_getI2C1MemAddrSize(me->iDev);
            i2cWriteMemReqEvt->memAccessType    = I2C_MEM_DMA;
            i2cWriteMemReqEvt->bytes            = me->bytesTotal; //TODO: remember to fix this.  This should not exceed max page size.
            MEMCPY(
                i2cWriteMemReqEvt->dataBuf,
                me->dataBuf,
                i2cWriteMemReqEvt->bytes
            );
            DBG_printf("QACTPosting I2C_BUS_WRITE_MEM_SIG with %d bytes\n", i2cWriteMemReqEvt->bytes );
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cWriteMemReqEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CBusDataEvt const *)e)->errorCode) {
                LOG_printf("Got I2C_BUS_DONE with no error\n");
                char tmp[120];
                memset(tmp, 0, sizeof(tmp));
                uint16_t tmpLen = 0;
                CBErrorCode err = CON_hexToStr(
                    (const uint8_t *)((I2CBusDataEvt const *)e)->dataBuf, // data to convert
                    ((I2CBusDataEvt const *)e)->dataLen, // length of data to convert
                    tmp,                                 // where to write output
                    sizeof(tmp),                         // max size of output buffer
                    &tmpLen,                             // size of the resulting output
                    0,                                   // no columns
                    ' '                                  // separator
                );
                if ( ERR_NONE != err ) {
                    WRN_printf("Got an error converting hex array to string.  Error: 0x%08x\n", err);
                }
                LOG_printf("Read %s\n", tmp);
                status_ = Q_TRAN(&I2C1DevMgr_PostWriteWait);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::WriteMem::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::PostWriteWait} ......................*/
static QState I2C1DevMgr_PostWriteWait(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::PostWriteWait} */
        case Q_ENTRY_SIG: {
            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                MS_TO_TICKS( HL_MAX_TIME_MS_I2C_POST_WRITE )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::PostWriteWait} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cWriteTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::PostWriteWait::EEPROM_POST_WRITE_TIMER} */
        case EEPROM_POST_WRITE_TIMER_SIG: {
            DBG_printf("Write to EEPROM finished with error: 0x%08x\n", me->errorCode);
            status_ = Q_TRAN(&I2C1DevMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus} ........................*/
static QState I2C1DevMgr_CheckingBus(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_CHECK_BUS_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_BUS_CHECK )
            );

            /* Allocate a dynamic event to send back the result after attempting to recover
             * the I2C bus. */
            I2CAddrEvt *i2cAddrEvt = Q_NEW( I2CAddrEvt, I2C_BUS_CHECK_FREE_SIG );
            i2cAddrEvt->i2cBus     = me->iBus;
            i2cAddrEvt->addr       = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize   = I2C_getI2C1DevAddrSize(me->iDev);
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)(i2cAddrEvt), me);

            DBG_printf("ActivePosted I2C_BUS_CHECK_FREE\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_GenerateStart);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBus::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE} .....................*/
static QState I2C1DevMgr_CheckingBusIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_CHECK_BUS_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_BUS_CHECK )
            );

            /* Allocate a dynamic event to send back the result after attempting to recover
             * the I2C bus. */
            I2CAddrEvt *i2cAddrEvt = Q_NEW( I2CAddrEvt, I2C_BUS_CHECK_FREE_SIG );
            i2cAddrEvt->i2cBus     = me->iBus;
            i2cAddrEvt->addr       = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize   = I2C_getI2C1DevAddrSize(me->iDev);
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)(i2cAddrEvt), me);

            DBG_printf("ActivePosted I2C_BUS_CHECK_FREE\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_GenerateStartIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::CheckingBusIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE} ...................*/
static QState I2C1DevMgr_GenerateStartIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_START_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_START_BIT\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE::I2C_BUS_DONE::[NoErr?]::[Write?]} */
                if (I2C_OP_MEM_WRITE == me->i2cDevOp || I2C_OP_REG_WRITE == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_Send7BitAddrTxModeIOE);
                }
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE::I2C_BUS_DONE::[NoErr?]::[Read?]} */
                else if (I2C_OP_MEM_READ == me->i2cDevOp || I2C_OP_REG_READ == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_DisableAckIOE);
                }
                else {
                    status_ = Q_UNHANDLED();
                }
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE} ......................*/
static QState I2C1DevMgr_DisableAckIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_ACK_DIS_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_ACK_DIS_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_ACK_DIS\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_Send7BitAddrTxModeIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::DisableAckIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE} ..............*/
static QState I2C1DevMgr_Send7BitAddrTxModeIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV6_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV6 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_7BIT_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize     = I2C_getI2C1DevAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Transmitter;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_SendInternalAddrIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrTxModeIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE} ................*/
static QState I2C1DevMgr_SendInternalAddrIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV8_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV8 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_DEV_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = me->addrStart;
            i2cAddrEvt->addrSize     = I2C_getI2C1MemAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Transmitter;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE::I2C_BUS_DONE::[NoErr?]::[Read?]} */
                if (I2C_OP_MEM_READ == me->i2cDevOp || I2C_OP_REG_READ == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_GenerateStartIOE1);
                }
                /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE::I2C_BUS_DONE::[NoErr?]::[Write?]} */
                else if (I2C_OP_MEM_WRITE == me->i2cDevOp || I2C_OP_REG_WRITE == me->i2cDevOp) {
                    status_ = Q_TRAN(&I2C1DevMgr_SendRegValueIOE);
                }
                else {
                    status_ = Q_UNHANDLED();
                }
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendInternalAddrIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1} ..................*/
static QState I2C1DevMgr_GenerateStartIOE1(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_START_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_START_BIT\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_Send7BitAddrRxModeIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStartIOE1::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE} ..............*/
static QState I2C1DevMgr_Send7BitAddrRxModeIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV6_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV6 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_7BIT_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = I2C_getI2C1DevAddr(me->iDev);
            i2cAddrEvt->addrSize     = I2C_getI2C1DevAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Receiver;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_GenerateStopRIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::Send7BitAddrRxModeIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE} ...................*/
static QState I2C1DevMgr_GenerateStopRIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

