rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/I2C1DevMgr.c
            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_STOP_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_STOP_BIT\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_ReadRegIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopRIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE} .........................*/
static QState I2C1DevMgr_ReadRegIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_READ_MEM_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_READ )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CReadMemReqEvt *i2cReadMemEvt = Q_NEW( I2CReadMemReqEvt, I2C_BUS_READ_MEM_SIG );
            i2cReadMemEvt->i2cBus           = me->iBus;
            i2cReadMemEvt->addr             = me->addrStart;
            i2cReadMemEvt->addrSize         = I2C_getI2C1MemAddrSize(me->iDev);
            i2cReadMemEvt->memAccessType    = I2C_MEM_BYTE;
            i2cReadMemEvt->bytes            = me->bytesTotal;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cReadMemEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CBusDataEvt const *)e)->errorCode) {
                LOG_printf("Got I2C_BUS_DONE with no error\n");
                char tmp[10];
                memset(tmp, 0, sizeof(tmp));
                uint16_t tmpLen = 0;
                CBErrorCode err = CON_hexToStr(
                    (const uint8_t *)((I2CBusDataEvt const *)e)->dataBuf, // data to convert
                    ((I2CBusDataEvt const *)e)->dataLen, // length of data to convert
                    tmp,                                 // where to write output
                    sizeof(tmp),                         // max size of output buffer
                    &tmpLen,                             // size of the resulting output
                    0,                                   // no columns
                    ' '                                  // separator
                );
                if ( ERR_NONE != err ) {
                    WRN_printf("Got an error converting hex array to string.  Error: 0x%08x\n", err);
                }
                LOG_printf("Read %s\n", tmp);
                status_ = Q_TRAN(&I2C1DevMgr_EnableAckIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::ReadRegIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE} .......................*/
static QState I2C1DevMgr_EnableAckIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_ACK_EN_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_ACK_EN_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_ACK_EN\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                LOG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::EnableAckIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE} ....................*/
static QState I2C1DevMgr_SendRegValueIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV8_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV8 )
            );

            /* Allocate and directly post an event to the appropriate I2CBusMgr AO */
            I2CAddrEvt *i2cAddrEvt   = Q_NEW( I2CAddrEvt, I2C_BUS_SEND_DEV_ADDR_SIG );
            i2cAddrEvt->i2cBus       = me->iBus;
            i2cAddrEvt->addr         = me->dataBuf[0];
            i2cAddrEvt->addrSize     = I2C_getI2C1MemAddrSize(me->iDev);
            i2cAddrEvt->i2cDirection = I2C_Direction_Transmitter;
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], (QEvt *)i2cAddrEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                status_ = Q_TRAN(&I2C1DevMgr_GenerateStopWIOE);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::SendRegValueIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE} ...................*/
static QState I2C1DevMgr_GenerateStopWIOE(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE} */
        case Q_ENTRY_SIG: {
            /* Set error code */
            me->errorCode = ERR_I2C1DEV_EV5_TIMEOUT;

            /* Set timer */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_I2C_EV5 )
            );

            /* Directly post an event to the appropriate I2CBusMgr AO */
            static QEvt const qEvt = { I2C_BUS_STOP_BIT_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);

            DBG_printf("ActivePosted I2C_BUS_STOP_BIT\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->i2cOpTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE::I2C_BUS_DONE} */
        case I2C_BUS_DONE_SIG: {
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE::I2C_BUS_DONE::[NoErr?]} */
            if (ERR_NONE == ((I2CStatusEvt const *)e)->errorCode) {
                DBG_printf("Got I2C_BUS_DONE with no error\n");
                LOG_printf(
                    "Wrote 0x%02x to address 0x%02x on I2CBus%d device %d\n",
                    me->dataBuf[0],
                    me->addrStart,
                    me->iBus+1,
                    me->iDev
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            /* ${AOs::I2C1DevMgr::SM::Active::Busy::GenerateStopWIOE::I2C_BUS_DONE::[else]} */
            else {
                me->errorCode = ((I2CStatusEvt const *)e)->errorCode;
                ERR_printf(
                    "Got I2C_BUS_DONE with error: 0x%08x\n",
                    me->errorCode
                );
                status_ = Q_TRAN(&I2C1DevMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state indicates that the I2C bus is currently idle and the
 * incoming msg can be handled.
 * This state is the default rest state of the state machine and can handle
 * various I2C requests.  Upon entry, it also checks the deferred queue to see
 * if any request events are waiting which were posted while I2C bus was busy.
 * if there are any waiting, it will read them out, which automatically posts
 * them and the state machine will go and handle them.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2C1DevMgr::SM::Active::Idle} .....................................*/
static QState I2C1DevMgr_Idle(I2C1DevMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2C1DevMgr::SM::Active::Idle} */
        case Q_ENTRY_SIG: {
            /* recall the request from the private requestQueue */
            QActive_recall(
                (QActive *)me,
                &me->deferredEvtQueue
            );

            DBG_printf("back in Idle\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle} */
        case Q_EXIT_SIG: {
            me->bytesCurr = 0; // Reset the current byte counter
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::EEPROM_RAW_MEM_READ} */
        case EEPROM_RAW_MEM_READ_SIG: {
            me->iDev = EEPROM; // Set which device is being accessed
            me->addrStart = ((I2CEEPROMReadReqEvt const *)e)->addr;
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = ((I2CEEPROMReadReqEvt const *)e)->bytes;
            me->i2cDevOp = I2C_OP_MEM_READ;
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBus);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::EEPROM_SN_READ} */
        case EEPROM_SN_READ_SIG: {
            me->iDev = SN_ROM; // Set which device is being accessed
            me->addrStart = I2C_getI2C1MinMemAddr(me->iDev);
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = I2C_getI2C1PageSize(me->iDev);
            me->i2cDevOp = I2C_OP_MEM_READ;
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBus);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::EEPROM_EUI64_READ} */
        case EEPROM_EUI64_READ_SIG: {
            me->iDev = EUI_ROM; // Set which device is being accessed
            me->addrStart = I2C_getI2C1MinMemAddr(me->iDev);
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = I2C_getI2C1PageSize(me->iDev);
            me->i2cDevOp = I2C_OP_MEM_READ;
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBus);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::EEPROM_RAW_MEM_WRITE} */
        case EEPROM_RAW_MEM_WRITE_SIG: {
            me->iDev = EEPROM; // Set which device is being accessed
            me->addrStart = ((I2CEEPROMWriteReqEvt const *)e)->addr;
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = ((I2CEEPROMWriteReqEvt const *)e)->bytes;
            me->i2cDevOp = I2C_OP_MEM_WRITE;
            MEMCPY(
                me->dataBuf,
                ((I2CEEPROMWriteReqEvt const *)e)->dataBuf,
                me->bytesTotal
            );
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBus);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::IOEXP_REG_READ} */
        case IOEXP_REG_READ_SIG: {
            me->iDev = IO_EXP; // Set which device is being accessed
            me->addrStart = ((I2CDevRegReadReqEvt const *)e)->regAddr;
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = 1;
            me->i2cDevOp = I2C_OP_REG_READ;

            /*
            // Testing IO Expander manually
            DBG_printf("Testing IOExpander (blocking): init\n");
            uint8_t status = IOE16_Config();
            DBG_printf("Init returned status %d\n", status);
            */
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBusIOE);
            break;
        }
        /* ${AOs::I2C1DevMgr::SM::Active::Idle::IOEXP_REG_WRITE} */
        case IOEXP_REG_WRITE_SIG: {
            me->iDev = IO_EXP; // Set which device is being accessed
            me->addrStart = ((I2CDevRegWriteReqEvt const *)e)->regAddr;
            me->addrSize  = I2C_getI2C1MemAddrSize(me->iDev);
            me->bytesTotal = 1;
            me->dataBuf[0] = ((I2CDevRegWriteReqEvt const *)e)->regValue;
            me->i2cDevOp = I2C_OP_REG_WRITE;
            status_ = Q_TRAN(&I2C1DevMgr_CheckingBusIOE);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2C1DevMgr_Active);
            break;
        }
    }
    return status_;
}


/**
 * @} end addtogroup groupI2C
 */
/******** Copyright (C) 2014 Datacard. All rights reserved *****END OF FILE****/
